# ElemCategoryParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElemCategoryParam Property
ParameterTypeId Class See Also
---
"Category"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElemCategoryParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElemCategoryParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElemCategoryParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace